IDEA StatiCa Open Model
LoadCaseType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of load case
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum LoadCaseType
Public Enumeration LoadCaseType
public enum class LoadCaseType
Members
Member name | Value | Description
Permanent | 0 |  Permanent
Variable | 1 |  Variable
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace